Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memn.tmx
Source language: ca
Languages: es_es

source: Aquesta DTD es veu en la figura ; examinem ara la DTD línia a línia per a comprendre com s'usen les DTD per a definir famílies (tipus) de documents en XML: La primera línia declara que la DTD és una DTD de la versió 1.0 i que el joc de caràcters que s'usa és l'ISO-8859-1, també conegut com a Latin-1.
es_es: Esta DTD se ve en la figura ; examinamos ahora la DTD línea a línea para comprender cómo se usan las DTD para definir familias (tipos) de documentos en XML: La primera línea declara que la DTD es una DTD de la versión 1.0 y que el juego de caracteres que se usa es la ISO-8859-1, también conocido como Latin-1.

source: Però aquest tipus de presentació visual no és l'única transformació possible que podem obtindre amb fulls d'estil: com es mostra en la figura , amb el mateix document XML podem generar un conjunt de vistes del seu contingut en diferents mitjans (media) només usant el full d'estil adequat.
es_es: Pero este tipo de presentación visual no es la única transformación posible que podemos obtener con hojas de estilo: cómo se muestra en la figura , con el mismo documento XML podemos generar un conjunto de vistas de su contenido en diferentes medios (media) sólo usando la hoja de estilo adecuada.

source: La major part dels sistemes usen vocabularis grans i models estadístics.
es_es: La mayor parte de los sistemas usan vocabularios grandes y modelos estadísticos.

source: {Reconeixement automàtic de la parla}
es_es: {Reconocimiento automático del habla}

source: </body> </html> {Un document HTML, tal com el presentaria un editor normal de textos o usant l'opció ``view HTML source'' (veure font HTML) del navegador.
es_es: </body> </html> {Un documento HTML, tal como lo presentaría un editor normal de textos o usando la opción ``view HTML source'' (ver fuente HTML) del navegador.

source: Seguint amb la jerarquia d'inclusió d'elements en altres, tant el destinatari com el remitent tenen nom i número, i el text es compon de paràgrafs (<P></P>).
es_es: Siguiendo con la jerarquía de inclusión de elementos en otros, tanto el destinatario como el remitente tienen nombre y número, y el texto se compone de párrafos (<P></P>).

source: No en queda res.
es_es: No queda nada.

source: { Tedtol en negretes} Text del para0graf en lletra normal amb alguns incisos { en cursives} i una marca de final de para0graf al final. Els cara0cters que no pertanyen a l'ASCII esta0ndard s'indiquen amb codis especials (en aquest cas s'ha usat ANSI, amb { codepage} 1252, com es veu al principi del document), com per exemple en el mot { lingfcedstica}. [] {Part d'un document de text en format RTF}
es_es: { Tedtol en negritas} Texto del para0grafo en letra normal con algunos incisos { en cursivas} y una marca de final de para0grafo al final. Los caroa0cters que no pertenecen al ASCII estea0ndard se indican con códigos especiales (en este caso se ha usado ANSI, con { codepage} 1252, como se ve a primeros del documento), como por ejemplo en la palabra { lingfcedstica}. [] {Parte de un documento de texto en formato RTF}

source: Un esquema avançat de codificació de caràcters.
es_es: Un esquema avanzado de codificación de caracteres.

source: Per a especificar, per a un tipus determinat de document XML, quines etiquetes són vàlides, quins atributs pot tenir cada element, o quins elements poden anar dins d'un determinat element, en quin ordre o en quina quantitat, s'usa una DTD (document type definition o definició del tipus de document).
es_es: Para especificar, para un tipo determinado de documento XML, qué etiquetas son válidas, qué atributos puede tener cada elemento, o qué elementos pueden ir dentro de un determinado elemento, en qué orden o en qué cantidad, se usa una DTD (documento type definition o definición del tipo de documento).

source: {{1.9cm{Processador de XSL}}} {2.1cm{document (XML, HTML, etc.) }} $$ {Transformació de documents XML amb fulls d'estil XSL.}
es_es: {{1.9cm{Procesador de XSL}}} {2.1cm{documento (XML, HTML, etc.) }} $$ {Transformación de documentos XML con hojas de estilo XSL.}

source: Quants octets (bytes) ocupa el segment de XML següent:
es_es: Cuántos octetos (bytes) ocupa el segmento de XML siguiente:

source: S'ha d'esmentar que moltes operacions de formatatge es poden automatitzar i regularitzar usant els estils (p. ) Altres eines demanar una correcció ortogràfica del text; accedir a un diccionari de sinònims, etc.
es_es: Se tiene que mencionar que muchas operaciones de formateo se pueden automatizar y regularizar usando los estilos (p. ) Otras herramientas pedir una corrección ortográfica del texto; acceder a un diccionario de sinónimos, etc.

source: Un document HTML té un enllaç amb el text ``Més informació'' i amb URI de destinació enllaç en HTML?
es_es: ¿Un documento HTML tiene un enlace con el texto ``Más información'' y con URI de destino enlace en HTML?

source: |<a url="http://www.uc.za/t.html">aquest document</a>|
es_es: |<a url="http://www.uc.za/t.html">este documento</a>|

source: Aquestes tecles i combinacions de tecles que permeten un accés ràpid a operacions rutinàries se solen anomenar en anglés hotkeys; per exemple, en Windows, la combinació control--X retalla el text seleccionat, la combinació control--V insereix un text prèviament retallat, etc.
es_es: Estas teclas y combinaciones de teclas que permiten un acceso rápido a operaciones rutinarias se suelen denominar en inglés hotkeys; por ejemplo, en Windows, la combinación control--X recorta el texto seleccionado, la combinación control--V inserta un texto previamente recortado, etc.

source: Entre L'etiqueta ser Si hi ha algun atribut, el valor ha d'anar entre cometes.
es_es: Entre La etiqueta ser Si hay algún atributo, el valor tiene que ir entre comillas.

source: En XML i HTML, aquesta separació entre l'estructura del contingut i la presentació d'un document s'executa a través d'especificacions anomenades fulls d'estil.
es_es: En XML y HTML, esta separación entre la estructura del contenido y la presentación de un documento se ejecuta a través de especificaciones llamadas hojas de estilo.

source: La segona línia del fax de la figura especifica el tipus del document tot indicant d'una banda l'etiqueta arrel o principal del document (FAX) i l'URI (SYSTEM) on es troba la DTD.
es_es: La segunda línea del fax de la figura especifica el tipo del documento indicando por un lado la etiqueta raíz o principal del documento (FAX) y el URI (SYSTEM) donde se encuentra la DTD.

source: Els fulls d'estil CSS assignen característiques de presentació a cada element del document.
es_es: Las hojas de estilo CSS asignan características de presentación a cada elemento del documento.

source: Si les referències d'unes seccions a altres s'hagueren fet usant referències creuades simbòliques (molts processadors de textos les permeten), també s'actualitzarien automàticament.
es_es: Si las referencias de unas secciones a otras se hubieran hecho usando referencias cruzadas simbólicas (muchos procesadores de textos las permiten), también se actualizarían automáticamente.

source: Operacions de formatatge (normalment els paràgrafs es formaten sols, sense intervenció de la persona usuària en el procés, segons que el va teclejant): Seleccionar l'alineació o la justificació de les línies del text (alineades a la dreta, a l'esquerra, centrades, o justificades); seleccionar el format de la pàgina (grandària del paper, marges inferior, superior, dret i esquerre), etc.
es_es: Operaciones de formateo (normalmente los párrafos se formatean sólos, sin intervención de la persona usuaria en el proceso, según se va tecleando): Seleccionar la alineación o la justificación de las líneas del texto (alineadas a la derecha, a la izquierda, centradas, o justificadas); seleccionar el formato de la página (tamaño del papel, márgenes inferior, superior, derecho e izquierdo), etc.

source: També s'hi poden usar { editors}: la diferència entre un processador de textos i un { editor} és que aquest últim programa és un processador de textos ASCII, ANSI o Unicode senzills (sense informació de format, etc.) que normalment s'usa per a preparar textos en algun llenguatge artificial (per exemple, programes escrits en algun llenguatge de programació) que serviran de entrada per a un altre programa, o textos molt senzills on el format no és crucial, com un missatge electrònic senzill.
es_es: También se pueden usar { editores}: la diferencia entre un procesador de textos y un { editor} es que este último programa es un procesador de textos ASCII, ANSI o Unicode sencillos (sin información de formato, etc.) que normalmente se usa para preparar textos en algún lenguaje artificial (por ejemplo, programas escritos en algún lenguaje de programación) que servirán de entrada para otro programa, o textos muy sencillos donde el formato no es crucial, como un mensaje electrónico sencillo.

source: Un text informatitzat es caracteritza principalment {}
es_es: Un texto informatizado se caracteriza principalmente {}

source: Recentment s'ha fet una modificació anomenada ISO-8859-15, per a incloure, entre altres, el símbol de l'euro i resoldre alguns problemes referents al francés i al finés.
es_es: Recientemente se ha hecho una modificación llamada ISO-8859-15, para incluir, entre otras, el símbolo del euro y resolver algunos problemas referentes al francés y al finés.

source: El text HTML però sense les marques entre ``|<|'' i ``|/>|''.
es_es: El texto HTML pero sin las marcas entre ``|<|'' y ``|/>|''.

source: |<a href="http://www.uc.za/t.html">aquest document</a>|
es_es: |<a href="http://www.uc.za/t.html">este documento</a>|

source: Quant a l'operació, els processadors de text assumeixen que la major part dels caràcters que teclegem s'han d'inserir darrere del caràcter que actualment es troba destacat amb una marca anomenada { cursor} de text (pot ser diferent del cursor o apuntador que indica la posició virtual del ratolí en la pantalla), o bé l'han de sobrescriure.
es_es: En cuanto a la operación, los procesadores de texto asumen que la mayor parte de los caracteres que tecleamos se tienen que insertar detrás del carácter que actualmente se encuentra destacado con una marca llamada { cursor} de texto (puede ser diferente del cursor o apuntador que indica la posición virtual del ratón en la pantalla), o bien lo tienen que sobrescribir

source: El format HTML (hypertext markup language o llenguatge de marques per a hipertextos) és un dels tipus de document que es poden definir amb SGML (però no exactament amb XML; la versió XML de HTML s'anomena XHTML.}); HTML és molt important perquè és el llenguatge en el que estan escrits els hipertextos d'Internet (vegeu el capítol ) i el que interpreten els navegadors (vegeu l'apartat ).
es_es: El formato HTML (hypertext markup language o lenguaje de marcas para hipertextos) es uno de los tipos de documento que se pueden definir con SGML (pero no exactamente con XML; la versión XML de HTML se denomina XHTML.}); HTML es muy importante porque es el lenguaje en el que están escritos los hipertextos de Internet (ved el capítulo ) y el que interpretan los navegadores (ved el apartado ).

source: On és la DTD necessària per a validar-lo.
es_es: Dónde está la DTD necesaria para validarlo.

source: Després, només cal indicar al processador quina ha de ser la presentació de cada element d'aquesta estructura lògica i obtindrem la presentació desitjada.
es_es: Después, sólo hay que indicar al procesador qué presentación tiene que tener cada elemento de esta estructura lógica y obtendremos la presentación deseada.

source: Fent una anàlisi semàntica profunda de la frase.
es_es: Haciendo un análisis semántico profundo de la frase.

source: Els caràcters i els seus números de codi.
es_es: Los caracteres y sus números de código.

source: En el cas de textos tipografiats la tasca és molt més senzilla; en el cas de manuscrits, la complexitat és comparable a la del reconeixement de la parla.
es_es: En el caso de textos tipografiados la tarea es mucho más sencilla; en el caso de manuscritos, la complejidad es comparable a la del reconocimiento del habla.

source: El RAP és especialment difícil per la gran variabilitat acústica que presenten els fonemes: segons el context articulatori (per exemple, no és igual el so del fonema palatal representat pel dígraf ig en ``passeig curt'' ---sord--- que en ``passeig allargat'' ---sonor---); segons el parlant (cada persona té uns organs fonadors de forma diferent ---acústicament diferents--- i processos de producció de la parla diferents ---per exemple, n'hi ha qui parla més a poc a poc i qui parla molt de pressa---); segons el dialecte del parlant (per exemple, els valencians fem africades les j que en català central són palatals fricatives sonores).
es_es: El RAH es especialmente difícil por la gran variabilidad acústica que presentan los fonemas: según el contexto articulatorio (por ejemplo, no es igual el sonido del fonema palatal representado por el dígrafo ig en catalán como en ``passeig curt'' ---sordo--- que en ``passeig allargat'' ---sonoro---); según el hablante (cada persona tiene unos órganos fonadores de forma diferente ---acústicamente diferentes--- y procesos de producción del habla diferentes ---por ejemplo, hay quién habla más despacio y quien habla muy deprisa---); según el dialecto del hablante (por ejemplo, los valencianos hacemos africadas las j que en catalán central son palatales fricativas sonoras).

source: Unicode} (ISO 10646) és un nou estàndard per a fitxers de text que permet codificar pràcticament totes les llengües del món i fins i tot mesclar diversos alfabets en un mateix fitxer.=2.147.483.648$ caràcters diferents} La versió més comunament usada d'Unicode (BMP, Basic Multilingual Plane) té 65534 caràcters; això comportaria l'ús de 2 octets (16 bits) en comptes d'un ($2^{16}=65536$); això fa que un text Unicode senzill siga el doble de gran que el text ASCII corresponent, però hi ha mètodes de serialització d'Unicode, com l'UTF-8, que en el cas de les llengües europees amb alfabet llatí estalvia espai perquè usa un únic octet per als codis ASCII (del 0 al 127, els més freqüents), i més d'un octet per als codis següents (així, a més, és compatible amb l'ASCII).
es_es: Unicode} (ISO 10646) es un nuevo estándar para ficheros de texto que permite codificar prácticamente todas las lenguas del mundo e incluso mezclar varios alfabetos en un mismo fichero.=2.147.483.648$ caracteres diferentes} La versión más comúnmente usada de Unicode (BMP, Basic Multilingual Plane) tiene 65534 caracteres; esto comportaría el uso de 2 octetos (16 bits) en vez de uno ($2^{16}=65536$); esto hace que un texto Unicode sencillo sea el doble de grande que el texto ASCII correspondiente, pero hay métodos de serialització de Unicode, como el UTF-8, que en el caso de las lenguas europeas con alfabeto latino ahorra espacio porque usa un único octeto para los códigos ASCII (del 0 al 127, los más frecuentes), y más de un octeto para los códigos siguientes (así, además, es compatible con el ASCII).

source: Per exemple, una recerca amb l'expressió regular pres*a trobaria els mots prea, presa, pressa, presssa, etc.
es_es: Por ejemplo, una investigación con la expresión regular en catalán pres*a encontraría las palabras prea, presa, pressa, presssa, etc.

source: Això és possible perquè la major part dels processadors van fornits de manuals o de sistemes d'ajuda en línia; alguns tenen fins i tot ``assistents'' que observen el que fa la persona usuària i li suggereixen ---amb més o menys fortuna--- possibles accions en cada moment.
es_es: Esto es posible porque la mayor parte de los procesadores van abastecidos de manuales o de sistemas de ayuda en línea; algunos tienen incluso ``asistentes'' que observan lo que hace la persona usuaria y le sugieren ---con más o menos fortuna--- posibles acciones en cada momento.

source: Hi ha una tendència a considerar el format de document de Microsoft Word, amb extensió .doc, com la manera estàndard d'enviar documents de text annexos a un missatge electrònic, sense considerar el fet que aquest format és privat i està associat a l'ús d'un determinat producte comercial.
es_es: Hay una tendencia a considerar el formato de documento de Microsoft Word, con extensión .doc, como la manera estándar de enviar documentos de texto anejos a un mensaje electrónico, sin considerar el hecho que este formato es privado y está asociado al uso de un determinado producto comercial.

source: {} si només usa els noms d'elements definits a la DTD; la resta de les directrius de la DTD només serveixen per fer documents ben formats.
es_es: {} si sólo usa los nombres de elementos definidos en la DTD; el resto de las directrices de la DTD sólo sirven para hacer documentos muy formados.

source: Si l'èmfasi en el document ha estat emmagatzemat com a èmfasi i no amb lletra negreta o cursiva, si els títols de secció estan indicats com a tals i no perquè són paràgrafs d'una única línia en negretes grosses, serà molt més fàcil transformar-lo per a la presentar-lo en un mitjà no visual o en una pantalla reduïda o limitada, per exemple, usant fulls d'estil especialment concebuts per a la presentació aural (sonora), tàctil (Braille), etc.
es_es: Si el énfasis en el documento ha sido almacenado como énfasis y no con letra negrita o cursiva, si los títulos de sección están indicados como tales y no porque son párrafos de una única línea en negritas gordas, será mucho más fácil transformarlo para presentarlo en un medio no visual o en una pantalla reducida o limitada, por ejemplo, usando hojas de estilo especialmente concebidos para la presentación aural (sonora), táctil (Braille), etc.

source: Típicament, s'obrin amb <nom> i es tanquen amb </nom>.
es_es: Típicamente, se abren con <nombre> y se cierran <con /nombre>.

source: En els caràcters assignats als codis del 128 al 255.
es_es: En los caracteres asignados a los códigos del 128 al 255.

source: Què veiem si obrim un text HTML amb un editor de textos senzill com el bloc de notes o Notepad de Windows?
es_es: ¿Qué vemos si abrimos un texto HTML con un editor de textos sencillo como el bloque de notas o Notepad de Windows?

source: Sí, si la resta del document és vàlida.
es_es: Sí, si el resto del documento es válido.

source: Si en un document XML trobem la situació |<rec><id>Zork</id><addr>Zmeggs</addr></rec>| i una DTD defineix l'element |rec| amb la regla |<!ELEMENT rec (id,up?,addr*)>| Pot ser que el document siga vàlid segons la DTD?
es_es: Si en un documento XML encontramos la situación |<rec><id>Zork</id><addr>Zmeggs</addr></rec>| y una DTD define el elemento |rec| con la regla |<!ELEMENT rec (id,up?,addr)>| ¿Puede ser que el documento sea válido según la DTD?

source: Per exemple, si volem que un text tinga un cert format, només podrem usar caràcters de control con l'espai en blanc, el tabulador, el salt de línia, etc.
es_es: Por ejemplo, si queremos que un texto tenga un cierto formato, sólo podremos usar caracteres de control cono el espacio en blanco, el tabulador, el salto de línea, etc.

source: {}un conjunt de directrius per a definir diferents llenguatges consistents en marques entre ``|<|'' i ``|>|'' i en regles d'inclusió dels elements que defineixen en altres elements.
es_es: {}un conjunto de directrices para definir diferentes lenguajes consistentes en marcas entre ``|<|'' y ``|>|'' y en reglas de inclusión de los elementos que definen en otros elementos.

source: El text HTML tal com està fet per dins, amb les marques entre ``|<|'' i ``|>|'' i tot.
es_es: El texto HTML tal como está hecho por dentro, con las marcas entre ``|<|'' y ``|>|'' y todo.

source: |<cv><nom>Pere</nom><any>1992</any><ob>Crits</ob><ob>Plors</ob></cv>|
es_es: |<cv><nom>Pere</nom><any>1992</any><ob>Gritos</ob><ob>Llantos</ob></cv>|

source: Marques Esquemes Carpetes Per a validar un document XML necessitem{}
es_es: Marcas Esquemas Carpetas Para validar un documento XML necesitamos{}

source: Hi ha altres codificacions en la família ISO-8859; per exemple, l'albanés, el bosni, el croat, el txec, l'hongarés, o el romanés usen una codificació anomenada ISO-8859-2 o Latin-2, el letó, el lituà i l'estonià usen l'ISO-8859-4 o Latin 4, el rus usa l'ISO-8859-5 que conté l'alfabet ciríl·lic a més de l'alfabet llatí bàsic, etc.
es_es: Hay otras codificaciones en la familia ISO-8859; por ejemplo, el albanés, el bosni, el croata, el checo, el húngaro, o el rumano usan una codificación llamada ISO-8859-2 o Latin-2 , el letón, el lituano y el estonià usan la ISO-8859-4 o Latin 4, el ruso usa la ISO-8859-5 que contiene el alfabeto cirílico además del alfabeto latino básico, etc.

source: En concret, UTF-8 usa per als codis del 0 al 127, 1 octet (compatible amb ASCII) per als codis del 128 al 2047, 2 octets per als codis del 2048 al 65535, 3 octets, i així successivament.
es_es: En concreto, UTF-8 usa para los códigos del 0 al 127, 1 octeto (compatible con ASCII) para los códigos del 128 al 2047, 2 octetos para los códigos del 2048 al 65535, 3 octetos, y así sucesivamente.

source: Si en una DTD trobem la regla |<!ELEMENT cv (nom,any?,ob+)>| quina de les tres situacions següents no és vàlida d'acord amb aquesta DTD?
es_es: Si en una DTD encontramos la regla |<!ELEMENT cv (nom,any?,ob+)>| ¿cuál de las tres situaciones siguientes no es válida de acuerdo con esta DTD?

source: No, perquè totes les llengües occidentals que usen l'alfabet llatí es poden codificar amb el joc de caràcters ISO-8859-15.
es_es: No, porque todas las lenguas occidentales que usan el alfabeto latino se pueden codificar con el juego de caracteres ISO-8859-15.

source: En els caràcters assignats als 256 codis.
es_es: En los caracteres asignados a los 256 códigos.

source: Els elements no es poden solapar o creuar: no és possible escriure, per exemple, <a>text<b>més text</a>més text encara </b>.
es_es: Los elementos no se pueden solapar o cruzar: no es posible escribir, por ejemplo, <a>texto<b>más texto</a>más texto todavía </b>.

source: <?xml version="1.0" encoding="ISO-8859-1"?> La segona línia és un comentari.
es_es: <?xml version="1.0" encoding="ISO-8859-1"?> La segunda línea es un comentario.

source: Els codis del 0 al 31 no corresponen a caràcters imprimibles sinó a caràcters de control.}
es_es: Los códigos del 0 al 31 no corresponden a caracteres imprimibles sino a caracteres de control.}

source: {} si segueix les regles de la DTD quan inclou un element dins d'un altre i, a més, no inclou cap element no definit a la DTD.
es_es: {} si sigue las reglas de la DTD cuando incluye un elemento dentro de otro y, además, no incluye ningún elemento no definido en la DTD.

source: PDF (de l'anglés portable document format, format portable de document) és un altre format desenvolupat per a capturar completament les característiques presentacionals dels documents.
es_es: PDF (del inglés portable document format, formato portable de documento) es otro formato desarrollado para capturar completamente las características de presentación de los documentos.

source: En un sistema de reconeixement automàtic de la parla, com es fa per a elegir entre efectiu en frases com ``en efectiu'' o ``treball efectiu'' o afectiu en ``desenvolupament afectiu'' o ``àmbit afectiu''?
es_es: En un sistema de reconocimiento automático del habla, ¿qué se hace para elegir entre efectiu en frases como ``en efectiu'' o ``treball efectiu'' o afectiu en ``desenvolupament afectiu'' o ``àmbit afectiu''?

source: [Contingut, estructura i presentació]{Contingut, estructura i presentació dels documents}
es_es: [Contenido, estructura y presentación]{Contenido, estructura y presentación de los documentos}
